The ordinate dimension line style.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
  Since:  2017 Subscription Update
 Syntax
  C#
public enum OrdinateDimensionLineStyle
  Visual Basic
Public Enumeration OrdinateDimensionLineStyle
  Visual C++
public enum class OrdinateDimensionLineStyle
 Members
  Member name  |   Description
   None   |   the invalid ordinate dimension line style
   Continuous   |   the continuous ordinate dimension line style
   Segmented   |   the segmented ordinate dimension line style
 See Also
  Autodesk.Revit.DB Namespace